# Problem Set #4 - from E/R diagram to Database Tables
<figure width=100%>
  <IMG SRC="https://www.colorado.edu/cs/profiles/express/themes/cuspirit/logo.png" WIDTH=50 ALIGN="right">
</figure>
    
## CSCI 3287 
<hr>

## Modify this cell and put your Name and email

Name: ```Jonathan Hu```

Email:   ```johu5262@colorado.edu```


#### Here are the rules for populating your database tables:

* Must use a series of INSERT statements in your JupyterLab notebook.  Hint: you should probably clear the tables at start of the notebook.

* Create at least 3 teams.
* Each team must have at least 3 players.  (Remember that players can only belong to one team)
* Create at least 3 games.   Each game must have:
  * at least one pass play
  * at least one run play
  * at least 3 players involed in plays
  * at least one pass play of more than 25 yards
  * at least one running play of more than 10 yards
  * at least one play for each team
 <br><br>
 
* Every player must be assigned to a team.  You will need to order the INSERT operations to handle the constraints 

#### Use the JupyterLab notebook to show the state of the tables

* Show the state of your databases using __```select *```__ for __Team__, __Player__, __Plays__ and __Game__.

* Provide a SQL query to show the roster for each team, listing the team name and player names.

* Provide a SQL query to show the plays for each game, 
  * all plays are listed in one table, ordered by the  __Team__ id, __Game__ id
  * show __Team__ name, __Game__ id, 
  * If the play is a "pass" indicate that "X passed to Y", where X and Y are player names 
  * If the play is a run indicate "X ran", where X is a player name 
  * To handle the play type, [you may want to use a CASE statement](http://www.mysqltutorial.org/mysql-case-function/)
  * Indicate the yardage in another column
<br><br>

* Using  a ```__try...except__ block```,  attempt to INSERT an existing player from the first team into the second team. This should raise an exception and fail.

* Delete one of your __Teams__. This should cascade a series of changes:
  * deleting the __Player__ records for that team
  * deleting the __Plays__ for that player 
  * deleting any __Game__ for that __Team__
<br><br>

* Show the database state after the deletes, using a __```select *```__ for __Team__, __Player__, __Plays__ and __Game__.

## Besure to add comments to your code or add markdown cells explaining how your SQL statements are modifying the database tables.

In [1]:
# Connect to the CSPB MySQL Database
#
#import os
#import configparser

#mycfg = configparser.ConfigParser()
#mycfg.read("/home/jovyan/CS-3287/mysql.cfg")
#print(f"User    : [{mycfg['mysql']['user']}]")
#database = mycfg['mysql']['url'].split('@')[1]  # leave off the password
#print(f"Database: [[mysql://{mycfg['mysql']['user']}...@{database}]")

#db_url = mycfg['mysql']['url'] 
#os.environ['DATABASE_URL'] = db_url

In [1]:
import os
import configparser

mysqlcfg = configparser.ConfigParser()
mysqlcfg.read("../mysql.cfg")    # YOUR CONFIG FILE HERE
user, passwd = mysqlcfg['mysql']['user'], mysqlcfg['mysql']['passwd']
dburl = f"mysql://{user}:{passwd}@applied-sql.cs.colorado.edu:3306/{user}"
os.environ['DATABASE_URL'] = dburl  # define this env. var for sqlmagic

In [2]:
# Load the sql magic 
# Get the MySQL version number to verify we are connected
#
%reload_ext sql
print ("get version...")
%sql SELECT version()

get version...
1 rows affected.

[('8.0.33',)]

In [3]:
# Begin Solution

In [4]:
# When creating this database, I incorporated some of my classmates feedback in order to improve my database. The main changes that I have implemented were
# separate tables for Running and Pass plays to have an easier time differentiating them in the play table along with the removal of the coach table since it was unnecessary.

In [5]:
# Table Creation

In [6]:
%%sql
-- Clear existing data in the tables used to rerun queries
DELETE FROM RunningPlay;
DELETE FROM PassPlay;
DELETE FROM Play;
DELETE FROM Game;
DELETE FROM Player;
DELETE FROM Team;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
1 rows affected.
1 rows affected.
2 rows affected.
1 rows affected.
6 rows affected.
2 rows affected.

[]

In [7]:
%%sql
-- Deletes All Tables
DROP TABLE IF EXISTS RunningPlay;
DROP TABLE IF EXISTS PassPlay;
DROP TABLE IF EXISTS Play;
DROP TABLE IF EXISTS Game;
DROP TABLE IF EXISTS Player;
DROP TABLE IF EXISTS Team;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [8]:
# Table Creation

In [9]:
%%sql
CREATE TABLE Team (
    TeamID INT PRIMARY KEY,
    Name VARCHAR(255), 
    City VARCHAR(255),
    State VARCHAR(255),
    FoundedYear INT
);

CREATE TABLE Player (
    PlayerID INT PRIMARY KEY,
    FirstName VARCHAR(255),
    LastName VARCHAR(255),
    DateOfBirth DATE,
    JerseyNumber INT,
    TeamID INT,
    FOREIGN KEY (TeamID) REFERENCES Team(TeamID)
);

CREATE TABLE Game (
    GameID INT PRIMARY KEY,
    Date DATE,
    Stadium VARCHAR(255),
    Score VARCHAR(255),
    City VARCHAR(255),
    HomeTeamID INT,
    AwayTeamID INT,
    FOREIGN KEY (HomeTeamID) REFERENCES Team(TeamID),
    FOREIGN KEY (AwayTeamID) REFERENCES Team(TeamID)
);

CREATE TABLE Play (
    PlayID INT PRIMARY KEY,
    GameID INT,
    TouchDown BOOLEAN,
    YardsGained INT,
    FOREIGN KEY (GameID) REFERENCES Game(GameID)
);

CREATE TABLE PassPlay (
    PlayID INT PRIMARY KEY,
    PlayerOneID INT,
    PlayerTwoID INT,
    FOREIGN KEY (PlayID) REFERENCES Play(PlayID),
    FOREIGN KEY (PlayerOneID) REFERENCES Player(PlayerID),
    FOREIGN KEY (PlayerTwoID) REFERENCES Player(PlayerID)
);

CREATE TABLE RunningPlay (
    PlayID INT PRIMARY KEY,
    PlayerOneID INT,
    PlayerTwoID INT,
    FOREIGN KEY (PlayID) REFERENCES Play(PlayID),
    FOREIGN KEY (PlayerOneID) REFERENCES Player(PlayerID),
    FOREIGN KEY (PlayerTwoID) REFERENCES Player(PlayerID)
);

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [10]:
#Inserting Data Into Tables:

In [11]:
%%sql
-- Teams

INSERT INTO Team (TeamID, Name, City, State, FoundedYear) VALUES
(1, 'Carps', 'Sacramento', 'California', 2000),
(2, 'Buffalos', 'Austin', 'Texas', 2005),
(3, 'Rocks', 'Denver', 'Colorado', 2010);

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
3 rows affected.

[]

In [12]:
%%sql
-- Players Data
INSERT INTO Player (PlayerID, FirstName, LastName, DateOfBirth, JerseyNumber, TeamID) VALUES
(1, 'John', 'Doe', '1990-01-15', 10, 1),
(2, 'Drake', 'Parlor', '1992-05-20', 22, 1),
(3, 'Mike', 'Johnson', '1993-08-10', 7, 1),
(4, 'Clark', 'Brown', '1991-03-25', 8, 2),
(5, 'Bob', 'Wilson', '1994-02-18', 19, 2),
(6, 'Jack', 'Lee', '1995-06-30', 4, 2),
(7, 'David', 'Miller', '1992-11-12', 5, 3),
(8, 'Soloman', 'Clark', '1996-04-02', 14, 3),
(9, 'Chris', 'Anderson', '1994-09-28', 9, 3);

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
9 rows affected.

[]

In [13]:
%%sql
-- Games Data
INSERT INTO Game (GameID, Date, Stadium, Score, City, HomeTeamID, AwayTeamID) VALUES
(1, '2023-09-01', 'Mirage', '24-21', 'Sacramento', 1, 2),
(2, '2023-09-08', 'Overpass', '17-14', 'Austin', 2, 3),
(3, '2023-09-15', 'Vertigo', '31-28', 'Denver', 3, 1);

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
3 rows affected.

[]

In [14]:
%%sql
-- Plays Data
INSERT INTO Play (PlayID, GameID, TouchDown, YardsGained) VALUES
(1, 1, TRUE, 30),
(2, 1, FALSE, 5),
(3, 2, TRUE, 15),
(4, 2, FALSE, 3),
(5, 3, TRUE, 40),
(6, 3, FALSE, 7);

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
6 rows affected.

[]

In [15]:
%%sql
-- PassPlays
INSERT INTO PassPlay (PlayID, PlayerOneID, PlayerTwoID) VALUES
(1, 1, 2),
(3, 4, 5),
(5, 7, 8);

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
3 rows affected.

[]

In [16]:
%%sql
-- Running Plays
INSERT INTO RunningPlay (PlayID, PlayerOneID, PlayerTwoID) VALUES
(2, 1, 3),
(4, 5, 6),
(6, 7, 8);

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
3 rows affected.

[]

In [17]:
%%sql
-- Show the state of database
-- Team Table
SELECT * FROM Team;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
3 rows affected.

[(1, 'Carps', 'Sacramento', 'California', 2000),
 (2, 'Buffalos', 'Austin', 'Texas', 2005),
 (3, 'Rocks', 'Denver', 'Colorado', 2010)]

In [18]:
%%sql
-- Player Table
SELECT * FROM Player;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
9 rows affected.

[(1, 'John', 'Doe', datetime.date(1990, 1, 15), 10, 1),
 (2, 'Drake', 'Parlor', datetime.date(1992, 5, 20), 22, 1),
 (3, 'Mike', 'Johnson', datetime.date(1993, 8, 10), 7, 1),
 (4, 'Clark', 'Brown', datetime.date(1991, 3, 25), 8, 2),
 (5, 'Bob', 'Wilson', datetime.date(1994, 2, 18), 19, 2),
 (6, 'Jack', 'Lee', datetime.date(1995, 6, 30), 4, 2),
 (7, 'David', 'Miller', datetime.date(1992, 11, 12), 5, 3),
 (8, 'Soloman', 'Clark', datetime.date(1996, 4, 2), 14, 3),
 (9, 'Chris', 'Anderson', datetime.date(1994, 9, 28), 9, 3)]

In [19]:
%%sql
SELECT * FROM Game;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
3 rows affected.

[(1, datetime.date(2023, 9, 1), 'Mirage', '24-21', 'Sacramento', 1, 2),
 (2, datetime.date(2023, 9, 8), 'Overpass', '17-14', 'Austin', 2, 3),
 (3, datetime.date(2023, 9, 15), 'Vertigo', '31-28', 'Denver', 3, 1)]

In [20]:
%%sql
SELECT * FROM Play;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
6 rows affected.

[(1, 1, 1, 30),
 (2, 1, 0, 5),
 (3, 2, 1, 15),
 (4, 2, 0, 3),
 (5, 3, 1, 40),
 (6, 3, 0, 7)]

In [21]:
%%sql
SELECT * FROM PassPlay;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
3 rows affected.

[(1, 1, 2), (3, 4, 5), (5, 7, 8)]

In [22]:
%%sql
SELECT * FROM RunningPlay;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
3 rows affected.

[(2, 1, 3), (4, 5, 6), (6, 7, 8)]

In [23]:
%%sql
-- Show the roster for each team
SELECT t.TeamID, t.City, t.State, p.FirstName, p.LastName
FROM Team t
LEFT JOIN Player p ON t.TeamID = p.TeamID;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
9 rows affected.

[(1, 'Sacramento', 'California', 'John', 'Doe'),
 (1, 'Sacramento', 'California', 'Drake', 'Parlor'),
 (1, 'Sacramento', 'California', 'Mike', 'Johnson'),
 (2, 'Austin', 'Texas', 'Clark', 'Brown'),
 (2, 'Austin', 'Texas', 'Bob', 'Wilson'),
 (2, 'Austin', 'Texas', 'Jack', 'Lee'),
 (3, 'Denver', 'Colorado', 'David', 'Miller'),
 (3, 'Denver', 'Colorado', 'Soloman', 'Clark'),
 (3, 'Denver', 'Colorado', 'Chris', 'Anderson')]

In [24]:
%%sql
-- Show the plays for each game
SELECT
    t1.City AS HomeTeamCity,
    t2.City AS AwayTeamCity,
    g.GameID,
    CASE
        WHEN pp.PlayID IS NOT NULL THEN CONCAT(p1.FirstName, ' passed to ', p2.FirstName)
        WHEN rp.PlayID IS NOT NULL THEN CONCAT(p1.FirstName, ' ran')
    END AS PlayDescription,
    p.YardsGained
FROM Game g
LEFT JOIN Team t1 ON g.HomeTeamID = t1.TeamID
LEFT JOIN Team t2 ON g.AwayTeamID = t2.TeamID
LEFT JOIN Play p ON g.GameID = p.GameID
LEFT JOIN PassPlay pp ON p.PlayID = pp.PlayID
LEFT JOIN RunningPlay rp ON p.PlayID = rp.PlayID
LEFT JOIN Player p1 ON pp.PlayerOneID = p1.PlayerID OR rp.PlayerOneID = p1.PlayerID
LEFT JOIN Player p2 ON pp.PlayerTwoID = p2.PlayerID;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
6 rows affected.

[('Sacramento', 'Austin', 1, 'John passed to Drake', 30),
 ('Sacramento', 'Austin', 1, 'John ran', 5),
 ('Austin', 'Denver', 2, 'Clark passed to Bob', 15),
 ('Austin', 'Denver', 2, 'Bob ran', 3),
 ('Denver', 'Sacramento', 3, 'David passed to Soloman', 40),
 ('Denver', 'Sacramento', 3, 'David ran', 7)]

In [25]:
# This trigger implemented will return a error if an existing player is inserted into another team.

In [26]:
%%sql
CREATE TRIGGER prevent_duplicate_player
BEFORE INSERT ON Player
FOR EACH ROW
BEGIN
    DECLARE existing_team_id INT;

    -- Check if the player already exists in another team
    SELECT TeamID INTO existing_team_id
    FROM Player
    WHERE PlayerID = NEW.PlayerID;

    IF existing_team_id IS NOT NULL AND existing_team_id != NEW.TeamID THEN
        SIGNAL SQLSTATE '45000'
        SET MESSAGE_TEXT = 'Cannot insert an existing player into a different team';
    END IF;
END;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
0 rows affected.

[]

In [27]:
#Attempt to insert an existing player into a different team
try:
    result = %sql insert into Player values(1, 'John', 'Doe', '1990-01-15', 10, 2);
    print(result)
except Exception as err:
    print("Error", err)

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
(MySQLdb.OperationalError) (1644, 'Cannot insert an existing player into a different team')
[SQL: insert into Player values(1, 'John', 'Doe', '1990-01-15', 10, 2);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)
None

In [28]:
# Deleteing Team 3 From Database. I was having trouble cascade deleting all information in relation to team 3.

In [29]:
%%sql
-- Delete Running Plays related to Team 3
DELETE FROM RunningPlay
WHERE PlayerOneID IN (SELECT PlayerID FROM Player WHERE TeamID = 3)
   OR PlayerTwoID IN (SELECT PlayerID FROM Player WHERE TeamID = 3)
   OR PlayID IN (SELECT PlayID FROM Play WHERE GameID IN (SELECT GameID FROM Game WHERE HomeTeamID = 3 OR AwayTeamID = 3));

-- Delete Pass Plays related to Team 3
DELETE FROM PassPlay
WHERE PlayerOneID IN (SELECT PlayerID FROM Player WHERE TeamID = 3)
   OR PlayerTwoID IN (SELECT PlayerID FROM Player WHERE TeamID = 3)
   OR PlayID IN (SELECT PlayID FROM Play WHERE GameID IN (SELECT GameID FROM Game WHERE HomeTeamID = 3 OR AwayTeamID = 3));

-- Delete Plays related to Team 3
DELETE FROM Play
WHERE GameID IN (SELECT GameID FROM Game WHERE HomeTeamID = 3 OR AwayTeamID = 3);

-- Delete Games related to Team 3
DELETE FROM Game
WHERE HomeTeamID = 3 OR AwayTeamID = 3;

-- Delete Players from Team 3
DELETE FROM Player
WHERE TeamID = 3;

-- Finally, delete Team 3
DELETE FROM Team
WHERE TeamID = 3;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
2 rows affected.
2 rows affected.
4 rows affected.
2 rows affected.
3 rows affected.
1 rows affected.

[]

In [30]:
# Displaying Database after the deletion of team 3.

In [31]:
%%sql
-- Show the database state after the deletes
SELECT * FROM Team;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
2 rows affected.

[(1, 'Carps', 'Sacramento', 'California', 2000),
 (2, 'Buffalos', 'Austin', 'Texas', 2005)]

In [32]:
%%sql
SELECT * FROM Player;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
6 rows affected.

[(1, 'John', 'Doe', datetime.date(1990, 1, 15), 10, 1),
 (2, 'Drake', 'Parlor', datetime.date(1992, 5, 20), 22, 1),
 (3, 'Mike', 'Johnson', datetime.date(1993, 8, 10), 7, 1),
 (4, 'Clark', 'Brown', datetime.date(1991, 3, 25), 8, 2),
 (5, 'Bob', 'Wilson', datetime.date(1994, 2, 18), 19, 2),
 (6, 'Jack', 'Lee', datetime.date(1995, 6, 30), 4, 2)]

In [33]:
%%sql
SELECT * FROM Game;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
1 rows affected.

[(1, datetime.date(2023, 9, 1), 'Mirage', '24-21', 'Sacramento', 1, 2)]

In [34]:
%%sql
SELECT * FROM Play;

 * mysql://johu5262:***@applied-sql.cs.colorado.edu:3306/johu5262
2 rows affected.

[(1, 1, 1, 30), (2, 1, 0, 5)]

In [35]:
# End Solution

<hr>

### When you have completed the assignment
* Be sure to **push** your changes to remote repository.
* Verify that all SQL commands run from the `Run All Cells` menu item.
* Submit the required information via Moodle.